# Переменные, присваивание, типы значений

"""
Переменная - область памяти, которая хранит какое-либо значение.

Для создания переменной необходимо:
1. Имя
2. Оператор присваивания (=)
3. Значение, приписываемое переменной

Переменная называется перменной, потому что её значение переменно.
В коде программы значение переменной может меняться неограниченное число раз.

Чтобы узнать значение переменной можно вывести её на экран:

См. Пример 1.1
"""

print("Пример 1.1")

my_variable = 100500
print("Значение переменной my_variable: ", my_variable)
my_variable = my_variable + 100500
print("Значение переменной my_variable: ", my_variable)
